tutorials/dbsBiofilmPimpleFoam/3d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  inlet
    {
      type            parabolicVelocity;
      maxValue        8.267195767195767e-3;
      n               (1 0 0);
      y               (0 1 0);
    }

  outlet
    {
      type            zeroGradient;
    }

  top
    {
      type fixedValue;
      value uniform (0 0 0);
    }
    
  bottom
    {
      type fixedValue;
      value uniform (0 0 0);
    }

  defaultFaces
    {
      type            empty;
    }
}


// ************************************************************************* //
