tutorials/dbsBiofilmPimpleFoam/3d/0/M.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      M;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  inlet
    {
      type zeroGradient;
    }
  
  outlet
    {
      type zeroGradient;
    }

  top
    {
      type zeroGradient;
    }
  
  bottom
    {
      type zeroGradient;
    }
  
  defaultFaces
    {
      type empty;
    }
}

// ************************************************************************* //
